app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
---
  def show
    # find_by returns nil when record not found while find throw an error
    @user = User.find_by(id: params[:id])

INSERT INTO `users` (`first_name`, `last_name`, `email`, `created_at`, `updated_at`) VALUES ('Itamar', 'Kestenbaum', 'itamar.kestenbaum@lemonade.com', '2020-11-03 21:03:24', '2020-11-03 21:03:24')
---
  def create
    @user = User.new(user_params)
    if @user.save()